tap "hashicorp/tap"
brew "awscli"
brew "elixir"
brew "ffmpeg"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "gopls"
brew "haskell-stack"
brew "jq"
brew "kotlin"
brew "markdown"
brew "marp-cli"
brew "mysql-client"
brew "node"
brew "nodenv"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "stow"
brew "hashicorp/tap/terraform"
brew "reviewdog/tap/reviewdog"
brew "uv"
brew "zsh"
brew "zsh-completions"
cask "android-studio"
cask "claude-code"
cask "docker-desktop"
cask "dropbox"
cask "emacs-app"
cask "evernote"
cask "firefox"
cask "font-hackgen"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gcloud-cli"
cask "google-drive"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rubymine"
cask "slack"
cask "sequel-ace"
cask "tomatobar"
cask "visual-studio-code"
cask "zoom"
vscode "ms-ceintl.vscode-language-pack-ja"
