tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "awscli"
brew "elixir"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "gopls"
brew "haskell-stack"
brew "jq"
brew "kotlin"
brew "node"
brew "nodenv"
brew "peco"
brew "pyenv"
brew "rbenv"
brew "stow"
brew "zsh"
brew "zsh-completions"
cask "android-studio"
cask "docker"
cask "dropbox"
cask "emacs"
cask "evernote"
cask "firefox"
cask "font-hackgen"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "postman"
cask "raycast"
cask "slack"
cask "tomatobar"
cask "visual-studio-code"
cask "zoom"
vscode "ms-ceintl.vscode-language-pack-ja"
