tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'caskroom/homebrew-versions'
tap 'railwaycat/emacsmacport'
tap 'motemen/ghq'

brew 'git'
brew 'zsh'
brew 'zsh-completions'
# brew 'emacs-mac'
brew 'https://gist.githubusercontent.com/ksato9700/0b3c71adafc256ddf280/raw/f48ac50bf8d1a16aa63606b137cd29b8fb1d7414/emacs.rb', args: ['japanese', 'cocoa']
brew 'cask', args: ['ignore-dependencies']

brew 'direnv'
brew 'wget'
brew 'tree'
brew 'ghq'
brew 'peco'
brew 'markdown'

brew 'readline'
brew 'rbenv'
brew 'ruby-build'

brew 'mysql'
brew 'redis'

brew 'imagemagick'
brew 'ghostscript'
brew 'ffmpeg'
brew 'homebrew/versions/phantomjs198'


brew 'elixir'
brew 'node'
brew 'python'
brew 'ghc'
brew 'scala'
cask 'racket'

cask 'google-japanese-ime'
cask 'karabiner'
cask 'bettertouchtool'
cask 'clipmenu'

cask 'google-chrome'
cask 'flash'
cask 'google-drive'
cask 'firefox'
cask 'skype'
cask 'dropbox'
cask 'evernote'
cask 'slack'

cask 'rowanj-gitx'
cask 'dash'
cask 'atom'
cask 'java'
cask 'mysqlworkbench'

cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'cord' # windows remote desktop

cask 'radiant-player'
cask 'spotify'
cask 'keepassx0'

cask 'butter' # idobata client
