tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "python@3.8"
brew "awscli"
brew "emacs"
brew "cask"
brew "direnv"
brew "elixir"
brew "ghc"
brew "ghq"
brew "git"
brew "go"
brew "jq"
brew "markdown"
brew "node"
brew "peco"
brew "q"
brew "rbenv"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "zsh-git-prompt"
cask "android-studio"
cask "atom"
cask "bettertouchtool"
cask "clipy"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "font-ricty-diminished"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "java"
cask "karabiner-elements"
cask "kindle"
cask "rowanj-gitx"
cask "slack"
cask "visual-studio-code"
cask "zoomus"
