tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'motemen/ghq'
tap 'konk303/emacs-inline-patched'
# tap-pin 'konk303/emacs-inline-patched'

brew 'git'
brew 'zsh'
brew 'zsh-completions'
# emacs from custom formula
brew 'emacs', args: ['with-cocoa']
brew 'cask'

brew 'direnv'
brew 'wget'
brew 'tree'
brew 'ghq'
brew 'peco'
brew 'markdown'
brew 'tmux'
brew 'awscli'
brew 's3cmd'
brew 'terraform'
cask 'google-cloud-sdk'

brew 'readline'
brew 'rbenv'
brew 'ruby-build'

brew 'mysql@5.6'
brew 'redis'
brew 'memcached'
brew 'mongodb'

brew 'imagemagick@6'
brew 'ghostscript'
brew 'ffmpeg'
brew 'phantomjs'
brew 'p7zip'

brew 'elixir'
brew 'node'
brew 'yarn'
brew 'python'
brew 'ghc'
cask 'java'
brew 'scala'
cask 'racket'
brew 'go'
brew 'nginx'
# electron building
cask 'xquartz'
brew 'wine'

cask 'google-japanese-ime'
cask 'karabiner'
cask 'bettertouchtool'
cask 'clipmenu'
cask 'docker'
cask 'google-chrome'
cask 'cyberduck'

cask 'google-drive'
cask 'firefox'
cask 'dropbox'
cask 'evernote'
cask 'slack'
cask 'vlc'
cask 'skype'
cask 'cord' # windows remote desktop

cask 'rowanj-gitx'
cask 'dash'
cask 'atom'
cask 'mysqlworkbench'
cask 'android-studio'

cask 'radiant-player'
cask 'spotify'

cask 'butter' # idobata client
